//Задача 1. Написать программу, которая принимает на вход трехзначное число и на выходе показывает вторую цифру этого числа. 
//Обязательна проверкка на ввод чисел больше или меньше 3-х знаков.

// Console.WriteLine("Введите трехзначное число: ");
// int numberA = int.Parse(Console.ReadLine()!);
// if(numberA > 99 && numberA < 1000){
//     Console.WriteLine($"Второй цифрой числа {numberA} является {numberA % 100 / 10}");
// }
// else{
//     Console.WriteLine($"Введено не трехзначное число");
// }    

// Задача 2. Написать программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. 
// Берем числа до 100000.

// Console.WriteLine("Введите число от 0 до 100000: ");
// int numberB = int.Parse(Console.ReadLine()!);

// if(numberB > 0 && numberB < 100){
//     Console.WriteLine($"Третьей цифры числа {numberB} нет");
// }
// if(numberB > 99 && numberB < 1000){
//     Console.WriteLine($"Третьей цифрой числа {numberB} является {numberB % 10}");
// }
// if(numberB > 999 && numberB < 10000){
//     Console.WriteLine($"Третьей цифрой числа {numberB} является {numberB % 100 /10}");
// }
// if(numberB > 9999 && numberB < 100000){
//     Console.WriteLine($"Третьей цифрой числа {numberB} является {numberB % 1000 /100}");
// }
// if(numberB > 99999){
//     Console.WriteLine($"Введенное число {numberB} не соответствует заданным границам");
// }


// Задача 3. Написать программу, которая принимает на вход цифру, обозначающую день недели и проверяет, является ли этот день выходным.
// Обязательна проверка на ввод числа <1 и >7.

//Задача 4. 
//Написать программу, которая будет выдаввать название дня недели по заданному номеру

// Console.WriteLine("Введи номер дня недели: ");
// int num = int.Parse(Console.ReadLine()!);

// if (num ==1)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Понедельник");
// if (num ==2)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Вторник");
// if (num ==3)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Среда");
// if (num ==4)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Четверг");
// if (num ==5)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Пятница");
// if (num ==6)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Суббота");
// if (num ==7)
// Console.WriteLine ($"Для числа {num} соответсвует день недели Воскресенье");
// if (num > 0 && num < 6){
//     Console.WriteLine ($"Это не выходной день");
// }
// if (num > 5 && num < 8){
//     Console.WriteLine ($"Это выходной день");
// }
// if (num > 7){
//     Console.WriteLine ($"В НЕДЕЛЕ ВСЕГО СЕМЬ ДНЕЙ");
// }


